<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork865-2022-01-01" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [114]:
!pip install sqlalchemy==1.3.9

Requirement already satisfied: sqlalchemy==1.3.9 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (1.3.9)

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [115]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [116]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [117]:
!pip install -q pandas==1.1.5

In [118]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [119]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")

In [120]:
# 아래는 Coursera 웹상에서 실행하지 않고, 내 PC 환경에서 실행하면 에러가 발생함.
# 데이터베이스에 커넥팅 하는 부분에서 ID와 PW를 전달하는 부분 때문인 것 같음.
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [121]:
# SPACEXTBL 테이블을 임시 테이블로 변경
%sql ALTER TABLE 'SPACEXTBL' RENAME TO 'temp_table';

# SPACEXTBL 테이블을 새로 생성하고 Date 컬럼의 자료형을 변경
%sql CREATE TABLE 'SPACEXTBL' ('Date' DATETIME, 'Time (UTC)' TEXT,'Booster_Version' TEXT,'Launch_Site' TEXT,'Payload' TEXT,'PAYLOAD_MASS__KG_' REAL,'Orbit' TEXT,'Customer' TEXT,'Mission_Outcome' TEXT,'Landing_Outcome' TEXT)

%sql INSERT INTO 'SPACEXTBL' SELECT * FROM 'temp_table';

# 임시 테이블을 삭제
%sql DROP TABLE 'temp_table';

%sql UPDATE 'SPACEXTBL' SET Date = DATETIME(SUBSTR(Date, 7, 4) || '-' || SUBSTR(Date, 4, 2) || '-' || SUBSTR(Date, 1, 2))

 * sqlite:///my_data1.db
Done.
 * sqlite:///my_data1.db
Done.
 * sqlite:///my_data1.db
101 rows affected.
 * sqlite:///my_data1.db
Done.
 * sqlite:///my_data1.db
101 rows affected.

[]

In [122]:
%sql SELECT DISTINCT Launch_Site FROM 'SPACEXTBL'

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [123]:
# '%CCA%'에 따옴표를 꼭 넣어야 한다.
%sql SELECT * FROM 'SPACEXTBL' WHERE Launch_Site LIKE '%CCA%' LIMIT 5

 * sqlite:///my_data1.db
Done.

[('2010-06-04 00:00:00', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0.0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08 00:00:00', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0.0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22 00:00:00', '07:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525.0, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08 00:00:00', '00:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01 00:00:00', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [124]:
%sql SELECT SUM(PAYLOAD_MASS__KG_) FROM 'SPACEXTBL' WHERE Customer LIKE '%NASA%'

 * sqlite:///my_data1.db
Done.

[(107010.0,)]

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [125]:
%sql SELECT AVG(PAYLOAD_MASS__KG_) FROM 'SPACEXTBL' WHERE Booster_Version LIKE '%F9 v1.1%'

 * sqlite:///my_data1.db
Done.

[(2534.6666666666665,)]

In [126]:
%sql SELECT * FROM 'SPACEXTBL' LIMIT 5

 * sqlite:///my_data1.db
Done.

[('2010-06-04 00:00:00', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0.0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08 00:00:00', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0.0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22 00:00:00', '07:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525.0, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08 00:00:00', '00:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01 00:00:00', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

In [127]:
'''%sql ALTER TABLE 'SPACEXTBL' ADD COLUMN date_column DATE

%sql UPDATE 'SPACEXTBL' SET date_column = date(Date)

#TEXT 형식의 date_string 열 삭제
#%sql ALTER TABLE 'SPACEXTBL' DROP COLUMN Date;'''

"%sql ALTER TABLE 'SPACEXTBL' ADD COLUMN date_column DATE\n\n%sql UPDATE 'SPACEXTBL' SET date_column = date(Date)\n\n#TEXT 형식의 date_string 열 삭제\n#%sql ALTER TABLE 'SPACEXTBL' DROP COLUMN Date;"

In [147]:
%sql SELECT * FROM 'SPACEXTBL' LIMIT 2

 * sqlite:///my_data1.db
Done.

[('2010-06-04 00:00:00', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0.0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08 00:00:00', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0.0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)')]

In [148]:
# Date 컬럼의 자료형을 확인
%sql select Date, typeof(Date) from 'SPACEXTBL' LIMIT 5

 * sqlite:///my_data1.db
Done.

[('2010-06-04 00:00:00', 'text'),
 ('2010-12-08 00:00:00', 'text'),
 ('2012-05-22 00:00:00', 'text'),
 ('2012-10-08 00:00:00', 'text'),
 ('2013-03-01 00:00:00', 'text')]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [157]:
# 날짜가 아닌 일자를 기준으로 MIN 값을 구하네... Datetime으로 바꿔야 할 듯.
# 컬럼명에 space가 있을 경우에는 [Landing _Outcome] 대괄호를 넣어 주어야 함

%sql SELECT min(Date) FROM 'SPACEXTBL' WHERE [Landing_Outcome] LIKE '%Success (ground pad)%'

 * sqlite:///my_data1.db
Done.

[('2015-12-22 00:00:00',)]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [158]:
%sql SELECT Booster_Version FROM 'SPACEXTBL' WHERE [Landing_Outcome] LIKE '%Success (drone ship)%' AND  (PAYLOAD_MASS__KG_ BETWEEN 4000 AND 6000)

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

### Task 7




##### List the total number of successful and failure mission outcomes

In [167]:
%sql SELECT Mission_Outcome, COUNT (Mission_Outcome) AS OUTCOME_count FROM SPACEXTBL GROUP BY MISSION_OUTCOME

 * sqlite:///my_data1.db
Done.

[('Failure (in flight)', 1),
 ('Success', 98),
 ('Success ', 1),
 ('Success (payload status unclear)', 1)]

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [135]:
#%sql SELECT max(PAYLOAD_MASS__KG_) FROM 'SPACEXTBL' #-> 15600이 나옴
#%sql SELECT Booster_Version FROM 'SPACEXTBL' WHERE PAYLOAD_MASS__KG_=15600
# 위의 두개의 문장을 합쳐주면 sub query가 완성된다.
%sql SELECT Booster_Version FROM 'SPACEXTBL' WHERE PAYLOAD_MASS__KG_=(SELECT max(PAYLOAD_MASS__KG_) FROM 'SPACEXTBL')

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [171]:
# '2015' with quotation mark
%sql SELECT Date,substr(Date, 6, 2), [Landing_Outcome], Booster_Version ,Launch_Site FROM 'SPACEXTBL' WHERE substr(Date, 1, 4)='2015' and [Landing_Outcome] LIKE '%Failure (drone ship)%'

 * sqlite:///my_data1.db
Done.

[('2015-01-10 00:00:00', '01', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('2015-04-14 00:00:00', '04', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

04-06-2010### Task 10




##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [177]:
%sql SELECT LANDING_OUTCOME, COUNT(*) AS COUNT_NO FROM SPACEXTBL WHERE DATE BETWEEN '2010-06-04' AND '2017-03-20' GROUP BY LANDING_OUTCOME ORDER BY COUNT_NO DESC

 * sqlite:///my_data1.db
Done.

[('No attempt', 10),
 ('Success (drone ship)', 5),
 ('Failure (drone ship)', 5),
 ('Success (ground pad)', 3),
 ('Controlled (ocean)', 3),
 ('Uncontrolled (ocean)', 2),
 ('Failure (parachute)', 2),
 ('Precluded (drone ship)', 1)]

In [138]:
%sql PRAGMA table_info('SPACEXTBL')

 * sqlite:///my_data1.db
Done.

[(0, 'Date', 'DATETIME', 0, None, 0),
 (1, 'Time (UTC)', 'TEXT', 0, None, 0),
 (2, 'Booster_Version', 'TEXT', 0, None, 0),
 (3, 'Launch_Site', 'TEXT', 0, None, 0),
 (4, 'Payload', 'TEXT', 0, None, 0),
 (5, 'PAYLOAD_MASS__KG_', 'REAL', 0, None, 0),
 (6, 'Orbit', 'TEXT', 0, None, 0),
 (7, 'Customer', 'TEXT', 0, None, 0),
 (8, 'Mission_Outcome', 'TEXT', 0, None, 0),
 (9, 'Landing_Outcome', 'TEXT', 0, None, 0)]

In [139]:
%sql PRAGMA table_info('SPACEXTBL')

 * sqlite:///my_data1.db
Done.

[(0, 'Date', 'DATETIME', 0, None, 0),
 (1, 'Time (UTC)', 'TEXT', 0, None, 0),
 (2, 'Booster_Version', 'TEXT', 0, None, 0),
 (3, 'Launch_Site', 'TEXT', 0, None, 0),
 (4, 'Payload', 'TEXT', 0, None, 0),
 (5, 'PAYLOAD_MASS__KG_', 'REAL', 0, None, 0),
 (6, 'Orbit', 'TEXT', 0, None, 0),
 (7, 'Customer', 'TEXT', 0, None, 0),
 (8, 'Mission_Outcome', 'TEXT', 0, None, 0),
 (9, 'Landing_Outcome', 'TEXT', 0, None, 0)]

In [140]:
%sql SELECT Date FROM 'SPACEXTBL' WHERE Landing_Outcome LIKE '%Success (ground pad)%' ORDER BY Date DESC LIMIT 1;

 * sqlite:///my_data1.db
Done.

[('2018-01-08 00:00:00',)]

In [141]:
%sql SELECT Date, COUNT(*) as success_count FROM 'SPACEXTBL' WHERE [Landing_Outcome] LIKE '%Success%' AND (Date BETWEEN '04-06-2010' AND '20-03-2017') GROUP BY Date ORDER BY Date DESC

 * sqlite:///my_data1.db
Done.

[]

In [142]:
#%sql SELECT Date FROM SPACEXTBL WHERE DATE=MAX(Date)
#%sql SELECT max(Date) from SPACEXTBL
#%sql SELECT MAXIMUM(Date) from SPACEXTBL

%sql SELECT HIGHEST(Date) from SPACEXTBL

 * sqlite:///my_data1.db
(sqlite3.OperationalError) no such function: HIGHEST
[SQL: SELECT HIGHEST(Date) from SPACEXTBL]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [143]:
%sql select min(payload_mass__kg_) from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[(0.0,)]

In [144]:
%sql select payload_mass__kg_ from SPACEXTBL order by payload_mass__kg_ LIMIT 1

 * sqlite:///my_data1.db
Done.

[(0.0,)]

In [145]:

%sql SELECT * FROM SPACEXTBL where DAYNAME(DATE)='Friday' LIMIT 5

 * sqlite:///my_data1.db
(sqlite3.OperationalError) no such function: DAYNAME
[SQL: SELECT * FROM SPACEXTBL where DAYNAME(DATE)='Friday' LIMIT 5]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [146]:
%sql SELECT sum(PAYLOAD_MASS__KG_) as Total_Payload_Mass from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[(619967.0,)]

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>